zephyrproject-rtos/zephyr/drivers/pwm/pwm_stm32.c
	/*
	 * Compensate input capture prescaler by right-shifting the measured period.
	 * prescaler_bits: 0..3 correspond to division by 1, 2, 4 or 8.
	 * Pulse measurement enforces prescaler_bits == 0, no scaling is required in that case.
	 */
	cpt->period = cpt->period >> cpt->prescaler_bits;

	if (cpt->callback != NULL) {
		cpt->callback(dev, channel, cpt->capture_period ? cpt->period : 0u,
				cpt->capture_pulse ? cpt->pulse : 0u, status, cpt->user_data);
	}
}

#endif /* CONFIG_PWM_CAPTURE */

static int pwm_stm32_get_cycles_per_sec(const struct device *dev,
					uint32_t channel, uint64_t *cycles)
{
	struct pwm_stm32_data *data = dev->data;
	const struct pwm_stm32_config *cfg = dev->config;

	*cycles = (uint64_t)(data->tim_clk / (cfg->prescaler + 1));

	return 0;
}

static DEVICE_API(pwm, pwm_stm32_driver_api) = {
	.set_cycles = pwm_stm32_set_cycles,
	.get_cycles_per_sec = pwm_stm32_get_cycles_per_sec,
#ifdef CONFIG_PWM_CAPTURE
	.configure_capture = pwm_stm32_configure_capture,
	.enable_capture = pwm_stm32_enable_capture,
	.disable_capture = pwm_stm32_disable_capture,
#endif /* CONFIG_PWM_CAPTURE */
};

static int pwm_stm32_init(const struct device *dev)
{
	struct pwm_stm32_data *data = dev->data;
	const struct pwm_stm32_config *cfg = dev->config;
	TIM_TypeDef *timer = cfg->timer;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	uint32_t tim_clk;
	int r;

	/* Enable clock and store its speed */
	r = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (r < 0) {
		LOG_ERR("Could not initialize clock (%d)", r);
		return r;
	}

	if (cfg->pclk_len > 1) {
		/* Enable Timer clock source */
		r = clock_control_configure(clk, (clock_control_subsys_t)&cfg->pclken[1], NULL);
		if (r != 0) {
			LOG_ERR("Could not configure clock (%d)", r);
			return r;
		}

		r = clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[1], &tim_clk);
	} else if (IS_ENABLED(CONFIG_SOC_SERIES_STM32MP2X)) {
		/* No selectable source: the gate clock rate is the timer clock rate */
		r = clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[0], &tim_clk);
	} else {
		LOG_ERR("Timer clock source is not specified");
		return -EINVAL;
	}
	if (r < 0) {
		LOG_ERR("Timer clock rate get error (%d)", r);
		return r;
	}

	data->tim_clk = tim_clk;

	/* Reset timer to default state using RCC */
	(void)reset_line_toggle_dt(&data->reset);

	/* configure pinmux */
	r = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (r < 0) {
		LOG_ERR("PWM pinctrl setup failed (%d)", r);
		return r;
	}

	/* initialize timer */
	LL_TIM_SetPrescaler(timer, cfg->prescaler);
	LL_TIM_SetAutoReload(timer, 0U);
	LL_TIM_EnableARRPreload(timer);

	if (IS_TIM_COUNTER_MODE_SELECT_INSTANCE(timer)) {
		LL_TIM_SetCounterMode(timer, cfg->countermode);
	}

	if (IS_TIM_CLOCK_DIVISION_INSTANCE(timer)) {
		LL_TIM_SetClockDivision(timer, LL_TIM_CLOCKDIVISION_DIV1);
	}

#ifdef IS_TIM_REPETITION_COUNTER_INSTANCE
	if (IS_TIM_REPETITION_COUNTER_INSTANCE(timer)) {
		LL_TIM_SetRepetitionCounter(timer, 0U);
	}
#endif

	if (IS_TIM_MASTER_INSTANCE(timer)) {
#if HAS_MASTERMODE_SUPPORT
		/* Preventing desynchronization between master and slave instances
		 * triggered by software update events (LL_TIM_GenerateEvent_UPDATE) during
		 * reconfiguration
		 */
		if (cfg->mastermode == LL_TIM_TRGO_UPDATE && is_center_aligned(cfg->countermode)) {
			LL_TIM_SetUpdateSource(timer, LL_TIM_UPDATESOURCE_COUNTER);
		}
#endif /* HAS_MASTERMODE_SUPPORT */
		ll_tim_set_trigger_output(timer, cfg->mastermode);
	} else {
		if (cfg->mastermode != 0) {
			LOG_ERR("%s: Timer does not support mastermode", dev->name);
			return -ENOTSUP;
		}
	}

	if (IS_TIM_SLAVE_INSTANCE(timer)) {
		LL_TIM_SetSlaveMode(timer, cfg->slavemode);
		LL_TIM_SetTriggerInput(timer, cfg->slave_trigger);
	} else {
		if (cfg->slavemode != LL_TIM_SLAVEMODE_DISABLED || cfg->slave_trigger != 0) {
			LOG_ERR("%s: Timer does not support slave mode", dev->name);
			return -ENOTSUP;
		}
	}

#ifdef IS_TIM_BREAK_INSTANCE
	/* Use the macro IS_TIM_BREAK_INSTANCE to check for supporting the
	 * break instance timers since some socs like L0/L1 will not
	 * compile and this checks explicitly for the api instead of the soc
	 */
	if (IS_TIM_BREAK_INSTANCE(timer)) {
		/* set the deadtime from the configuration */
		LL_TIM_OC_SetDeadTime(timer, cfg->deadtime);

		/* enable outputs and counter */
		LL_TIM_EnableAllOutputs(timer);
	} else if (cfg->deadtime != 0) {
		LOG_ERR("Setting deadtime %d on a non-break timer %s",
			cfg->deadtime, dev->name);
		return -ENOTSUP;
	}
#else
	if (cfg->deadtime != 0) {
		LOG_ERR("Setting deadtime %d on a non-break timer %s",
			cfg->deadtime, dev->name);
		return -ENOTSUP;
	}
#endif /* IS_TIM_BREAK_INSTANCE */

	LL_TIM_EnableCounter(timer);

#ifdef CONFIG_PWM_CAPTURE
	cfg->irq_config_func(dev);
#endif /* CONFIG_PWM_CAPTURE */

	return 0;
}

#define PWM(index) DT_INST_PARENT(index)

/*
 * The trigger input (TRGI) source is only used when the timer runs in slave
 * mode. Some series (e.g., WB0) lack some or all internal trigger (ITRx)
 * source macros, so only resolve LL_TIM_TS_* when slave mode is enabled;
 * otherwise use 0.
 */
#define PWM_SLAVE_TRIGGER(index)						\
	COND_CODE_0(DT_ENUM_HAS_VALUE(PWM(index), st_slavemode, disabled),	\
		    (CONCAT(LL_TIM_TS_,						\
			    DT_STRING_TOKEN(PWM(index),				\
					    st_trigger_selection))),		\
		    (0))

#ifdef CONFIG_PWM_CAPTURE
#define IRQ_CONNECT_AND_ENABLE_BY_NAME(index, name)				\
	{									\
		IRQ_CONNECT(DT_IRQ_BY_NAME(PWM(index), name, irq),		\
			    DT_IRQ_BY_NAME(PWM(index), name, priority),		\
			    pwm_stm32_isr, DEVICE_DT_INST_GET(index), 0);	\
		irq_enable(DT_IRQ_BY_NAME(PWM(index), name, irq));		\
	}

#define IRQ_CONNECT_AND_ENABLE_DEFAULT(index)					\
	{									\
		IRQ_CONNECT(DT_IRQN(PWM(index)),				\
			    DT_IRQ(PWM(index), priority),			\
			    pwm_stm32_isr, DEVICE_DT_INST_GET(index), 0);	\
		irq_enable(DT_IRQN(PWM(index)));				\
	}

#define IRQ_CONFIG_FUNC(index)                                                  \
	static void pwm_stm32_irq_config_func_##index(const struct device *dev)	\
	{									\
		COND_CODE_1(DT_IRQ_HAS_NAME(PWM(index), cc),			\
			    (IRQ_CONNECT_AND_ENABLE_BY_NAME(index, cc)),	\
			    (IRQ_CONNECT_AND_ENABLE_DEFAULT(index)))		\
	}

#define CAPTURE_INIT(index)							\
	.irq_config_func = pwm_stm32_irq_config_func_##index,			\
	.four_channel_capture_support = DT_INST_PROP(index, four_channel_capture_support)
#else /* CONFIG_PWM_CAPTURE */
#define IRQ_CONFIG_FUNC(index)
#define CAPTURE_INIT(index)
#endif /* CONFIG_PWM_CAPTURE */

