zephyrproject-rtos/zephyr/drivers/pwm/pwm_stm32.c
#define PWM_DEVICE_INIT(index)							\
	static struct pwm_stm32_data pwm_stm32_data_##index = {			\
		.reset = RESET_DT_SPEC_GET(PWM(index)),				\
	};									\
										\
	IRQ_CONFIG_FUNC(index)							\
										\
	PINCTRL_DT_INST_DEFINE(index);						\
										\
	static const struct stm32_pclken pclken_##index[] =			\
					STM32_DT_CLOCKS(PWM(index));		\
										\
	static const struct pwm_stm32_config pwm_stm32_config_##index = {	\
		.timer = (TIM_TypeDef *)DT_REG_ADDR(PWM(index)),		\
		.prescaler = DT_PROP(PWM(index), st_prescaler),			\
		.countermode = DT_PROP(PWM(index), st_countermode),		\
		.deadtime = DT_PROP(PWM(index), st_deadtime),			\
		.mastermode = COND_CODE_1(HAS_MASTERMODE_SUPPORT,		\
					  (CONCAT(LL_TIM_TRGO_,			\
						  DT_STRING_TOKEN(PWM(index),	\
						  st_mastermode))),		\
					  (0)),					\
		.slavemode = CONCAT(LL_TIM_SLAVEMODE_,				\
					DT_STRING_UPPER_TOKEN(PWM(index),	\
						st_slavemode)),			\
		.slave_trigger = PWM_SLAVE_TRIGGER(index),			\
		.pclken = pclken_##index,					\
		.pclk_len = DT_NUM_CLOCKS(PWM(index)),				\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),			\
		CAPTURE_INIT(index)						\
	};									\
										\
	IF_ENABLED(CONFIG_PWM_CAPTURE, (					\
		BUILD_ASSERT(							\
			DT_INST_PROP(index, four_channel_capture_support) == 1	\
			|| CONCAT(LL_TIM_SLAVEMODE_,				\
				DT_STRING_UPPER_TOKEN(PWM(index), st_slavemode))\
			== LL_TIM_SLAVEMODE_DISABLED,				\
			"Slave mode is only compatible with capture mode in "	\
			"`four-channel-capture-support` mode!");		\
		)								\
	)									\
										\
	DEVICE_DT_INST_DEFINE(index, &pwm_stm32_init, NULL,			\
			    &pwm_stm32_data_##index,				\
			    &pwm_stm32_config_##index, POST_KERNEL,		\
			    CONFIG_PWM_INIT_PRIORITY,				\
			    &pwm_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(PWM_DEVICE_INIT)
